import os
import json

# 定义标签映射关系
label_mappings = [{
    "12 0.620286 0.503311 0.097182 0.169762": "R",
    "9 0.405262 0.337073 0.097474 0.171797": "B",
    "5 0.303951 0.509705 0.097534 0.170775": "A",
    "3 0.522093 0.282602 0.095116 0.169368": "a",
    "8 0.181226 0.307285 0.093350 0.169181": "k",
    "8 0.721726 0.510625 0.097091 0.169764": "N",
    "12 0.403985 0.511040 0.097159 0.169386": "P",
    "13 0.618844 0.319058 0.095753 0.169466": "c",
    "11 0.719624 0.335990 0.096046 0.167380": "K",
    "12 0.514234 0.489558 0.096271 0.168697": "b",
    "7 0.411458 0.125303 0.095479 0.169119": "n",
    "2 0.280485 0.338217 0.098447 0.170168": "C",
    "12 0.820694 0.319392 0.094998 0.169518": "r",
    "6 0.191606 0.489253 0.091838 0.172703": "p"
},{
    "5 0.528906 0.386111 0.095312 0.166667": "R",
    "2 0.105859 0.662500 0.092969 0.158333": "B",
    "8 0.092969 0.338889 0.098437 0.172222": "A",
    "0 0.512891 0.647222 0.092969 0.169444": "a",
    "4 0.853906 0.352083 0.098437 0.179167": "k",
    "6 0.216016 0.822222 0.096094 0.175000": "N",
    "11 0.520703 0.211111 0.092969 0.166667": "P",
    "3 0.653125 0.398611 0.093750 0.166667": "c",
    "7 0.394922 0.511806 0.099219 0.168056": "K",
    "10 0.689063 0.220139 0.100000 0.173611": "b",
    "9 0.748047 0.662500 0.096094 0.183333": "n",
    "13 0.389844 0.303472 0.098437 0.173611": "C",
    "12 0.762956 0.863889 0.091276 0.140278": "r",
    "1 0.639453 0.794444 0.094531 0.177778": "p"
}]

def process_json_files(directory):
    """
    遍历目录中的所有JSON文件，并替换标签
    """
    # 遍历目录中的所有文件
    for filename in os.listdir(directory):
        if filename.endswith('.json'):
            file_path = os.path.join(directory, filename)

            # 读取JSON文件
            with open(file_path, 'r', encoding='utf-8') as f:
                data = json.load(f)

            # 处理shapes中的标签
            if 'shapes' in data:
                for shape in data['shapes']:
                    original_label = shape.get('label', '')
                    for label_mapping in label_mappings:
                        if original_label in label_mapping:
                            shape['label'] = label_mapping[original_label]

            # 将修改后的数据写回文件
            with open(file_path, 'w', encoding='utf-8') as f:
                json.dump(data, f, ensure_ascii=False, indent=2)

# 使用示例
process_json_files('E:\code\Embodied\src\cchessYolo\Images')
